{
  "backend/main.mo": "Motoko actor serving inspirational messages with queries for daily, all, and category-filtered messages, plus a stubbed blob upload function.",
  "feature_evidence.json": "Feature evidence report listing music‑removal tasks, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their roles in the app.",
  "frontend/index.css": "Tailwind base stylesheet defining color variables and theming for light and dark modes.",
  "frontend/index.html": "Root HTML file setting up the app container and loading the main entrypoint.",
  "frontend/src/App.tsx": "Wraps MainPage with ThemeProvider and renders global toast notifications.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend actor based on Internet Identity authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and provider managing Internet Identity login, state, and session restoration.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching daily message, motto, all messages, and category-filtered messages from the backend.",
  "frontend/src/index.css": "Tailwind CSS file defining a calming OKLCH color palette and utility classes for light/dark themes.",
  "frontend/src/main.tsx": "Application entrypoint that mounts React, sets up QueryClientProvider and InternetIdentityProvider, and loads global styles.",
  "frontend/src/music/tracks.ts": "Empty file previously used for music track configuration.",
  "frontend/src/pages/MainPage.tsx": "React page that displays a motto and daily message with animated transitions and styled UI elements. Uses custom hooks for data loading and shows skeletons while fetching.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, animations, typography, and container settings with custom plugins and theme variables.",
  "project_state.json": "Project metadata tracking state, issues, and feature requests, mainly focused on removing background music functionality."
}