{
  "backend/main.mo": "Motoko canister handling daily messages, streak tracking, profile management, and access-controlled actions like uploading music.",
  "feature_evidence.json": "Feature evidence report mapping specific frontend files to streak-celebration and check‑in logic requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of main frontend components, hooks, pages, and config files.",
  "frontend/index.css": "Tailwind base stylesheet defining extensive OKLCH color variables and theming for light and dark modes.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up QueryClientProvider and ThemeProvider and renders MainPage with toast notifications.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading states, error handling, and cache clearing.",
  "frontend/src/components/MoodCheckInCard.tsx": "Mood check‑in UI that triggers streak updates and shows celebratory toasts when the streak increases.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal allowing new users to enter and save their name with validation and feedback.",
  "frontend/src/components/StreakCard.tsx": "Displays the user’s streak with different UI states for unauthenticated, loading, error, and loaded cases.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for daily message, streak info, mood check-ins, and user profile interactions via the actor.",
  "frontend/src/index.css": "Configures Tailwind and custom OKLCH-based theme variables and utility classes for styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/music/tracks.ts": "Empty placeholder file for music track data.",
  "frontend/src/pages/MainPage.tsx": "Main UI page showing daily message, login, streak, mood check‑in, and profile setup with animated layout and error handling.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, and clear URL and sessionStorage parameters, including support for hash-based routing and persisted parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, container settings, and plugins for the frontend UI.",
  "project_state.json": "Stores project metadata, existing features, and pending feature requests for the habit/mood tracking app."
}