{
  "backend/main.mo": "Main backend actor implementing daily affirmation messages, user authentication with access control, daily check-in streak tracking, user profile management, and background music upload functionality with role-based permissions.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: a share button for daily affirmations and formatted share messages with attribution, both with high confidence and associated test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components for authentication, mood check-in, streak tracking, profile setup, and sharing functionality with Web Share API and clipboard fallback.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, defining a calming color palette and design tokens for the application's visual system.",
  "frontend/index.html": "HTML entry point with Version 10 meta tag, application title 'Stay Beautifully Positive', and script reference to the React TypeScript main module.",
  "frontend/src/App.tsx": "Root application component that sets up QueryClient with retry configuration, ThemeProvider for light theme, and renders MainPage with toast notifications.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component using Internet Identity that handles login/logout with loading states, error handling for duplicate authentication, and clears query cache on logout.",
  "frontend/src/components/MoodCheckInCard.tsx": "Card component for daily mood check-in with four mood options (great, good, okay, low), authentication guards, and toast notifications that celebrate streak extensions only when the count increases.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog for first-time user profile setup that prompts authenticated users to enter their name with form validation, loading states, and prevents dismissal until completed.",
  "frontend/src/components/StreakCard.tsx": "React component that displays the user's daily check-in streak count with authentication-gated access, loading states, error handling, and a gradient-styled flame icon.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching daily messages, streak info, user profiles, and performing mood check-ins with optimistic updates and cache invalidation.",
  "frontend/src/hooks/useShareAffirmation.ts": "Custom hook that enables sharing affirmations via Web Share API with clipboard fallback, formatting messages and handling errors with toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color palette for a calming theme (sky, lavender, rose, deep, soft) and dark mode support.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/music/tracks.ts": "Empty file, likely intended for music track definitions or configurations.",
  "frontend/src/pages/MainPage.tsx": "Main page component that displays daily affirmations with authentication, profile setup, streak tracking, mood check-in, and share functionality using Internet Identity and various custom hooks.",
  "frontend/src/utils/formatShareMessage.ts": "Utility function that formats affirmation text for sharing by appending attribution text '— Daily Affirmations'.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/src/version.ts": "Exports the application version constant set to 'Version 10'.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended animations, typography plugin, and container queries support.",
  "project_state.json": "Project state tracking file documenting the Daily Affirmations app with completed features for sharing affirmations with attribution and one pending feature request."
}