{
  "kind": "build_request",
  "title": "Remove background music and music controls",
  "projectName": "Stay Beautifully Positive",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove all background music playback logic from the main page, including the HTMLAudioElement creation, play/pause handling, volume handling, and track-switching side effects.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-11"
        ],
        "quotes": [
          "Remove the music, it isn't playing correctly."
        ]
      },
      "acceptanceCriteria": [
        "MainPage renders and functions without creating or controlling an Audio element.",
        "No audio starts playing (or attempts to play) when the app loads or when interacting with the page.",
        "There are no console errors related to audio playback (e.g., 'Audio playback failed')."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove all music-related UI from the main page, including the header play/pause button and the \"Music Controls\" panel (track selection, volume slider, now-playing status, and attribution).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-11"
        ],
        "quotes": [
          "Remove the music, it isn't playing correctly."
        ]
      },
      "acceptanceCriteria": [
        "The header no longer displays a play/pause music control button.",
        "The page no longer shows the \"Music Controls\" section, track selector, volume slider, now-playing text, or attribution text.",
        "The daily message and motto UI remain intact and centered appropriately without the removed music panel."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Remove the unused music track configuration dependency from the frontend by eliminating usage/imports of the track list used for background music.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-11"
        ],
        "quotes": [
          "Remove the music, it isn't playing correctly."
        ]
      },
      "acceptanceCriteria": [
        "MainPage no longer imports from \"frontend/src/music/tracks.ts\".",
        "The frontend builds successfully with no unused-import or missing-module errors related to music tracks."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (compose them only).",
    "Do not edit any files listed in frontend.immutablePaths in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Fixing or debugging audio playback issues.",
    "Adding new audio tracks, streaming, or alternate audio implementations.",
    "Changing the app’s non-music functionality (daily message, motto, theming) beyond layout adjustments needed after removing music UI."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}