{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove background music and music controls from MainPage",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove all background music playback logic from MainPage (audio element, play/pause, volume, and track-switching side effects).",
      "acceptanceCriteria": [
        "MainPage renders and functions without creating or controlling an Audio element.",
        "No audio starts playing (or attempts to play) when the app loads or when interacting with the page.",
        "There are no console errors related to audio playback (e.g., 'Audio playback failed')."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MainPage.tsx",
          "operation": "modify",
          "description": "Remove all HTMLAudioElement-related state/refs and side effects (audioRef, isPlaying, volume, track id, and the related useEffect hooks) and remove any play/pause handlers so no audio is created or controlled anywhere in MainPage."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove all music-related UI from MainPage (header control button and Music Controls panel) while keeping daily message and motto layout intact.",
      "acceptanceCriteria": [
        "The header no longer displays a play/pause music control button.",
        "The page no longer shows the \"Music Controls\" section, track selector, volume slider, now-playing text, or attribution text.",
        "The daily message and motto UI remain intact and centered appropriately without the removed music panel."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MainPage.tsx",
          "operation": "modify",
          "description": "Remove the header music Button and the entire \"Music Controls\" panel UI (including Select, Slider, now-playing status, and attribution). Update header/container layout classes as needed so the title/motto/message remain centered and visually balanced after the panel removal. Do not modify files under frontend/src/components/ui (compose them only). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Eliminate the unused music track configuration dependency by removing all track list imports/usages from the frontend.",
      "acceptanceCriteria": [
        "MainPage no longer imports from \"frontend/src/music/tracks.ts\".",
        "The frontend builds successfully with no unused-import or missing-module errors related to music tracks."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MainPage.tsx",
          "operation": "modify",
          "description": "Remove the import of tracks from frontend/src/music/tracks.ts and delete any remaining references to tracks/currentTrack/currentTrackId so MainPage is fully independent of the music track list."
        },
        {
          "path": "frontend/src/music/tracks.ts",
          "operation": "delete",
          "description": "Delete the now-unused background music track configuration module once no frontend code imports it, ensuring the project builds without missing-module or unused-import errors."
        }
      ]
    }
  ]
}