{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Streak extension celebratory message (frontend-only)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Display a small time-limited celebratory UI message only when an authenticated user successfully extends their streak after a daily check-in.",
      "acceptanceCriteria": [
        "After a successful check-in, the app displays a short celebratory message that is specifically tied to the streak being extended (not just streakCount > 0).",
        "The celebratory message automatically disappears after a short duration (e.g., a few seconds) without requiring user interaction.",
        "The celebratory message is not shown when the user is not authenticated, when the check-in fails, or when the user has already checked in for the current UTC day.",
        "All user-facing text for the celebratory message is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MoodCheckInCard.tsx",
          "operation": "modify",
          "description": "Update the check-in success UI to show a brief, auto-dismissing celebratory message (e.g., a Sonner toast) only when the streak was extended; ensure the message is English-only and never shown for unauthenticated users, failed check-ins, or same-day re-check-ins."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Determine whether a check-in extended the streak by comparing the mutation result to the previously cached/loaded streak value, and only trigger the celebratory message when the new value is greater.",
      "acceptanceCriteria": [
        "If the previous streak value is N and the check-in mutation returns N+1, the celebratory message is triggered.",
        "If the previous streak value is N and the check-in mutation returns N (e.g., already checked in today), the celebratory message is not triggered.",
        "The streak display remains accurate after check-in (streak query is refreshed/invalidated as needed)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the mood check-in mutation flow to capture the previously cached/loaded streak value (from the existing React Query cache for the current user's streak), return it via mutation context, and ensure the streak query is invalidated/refetched so the streak display remains accurate."
        },
        {
          "path": "frontend/src/components/MoodCheckInCard.tsx",
          "operation": "modify",
          "description": "Use the previous streak value (from the check-in mutation context) and the new streak returned by updateDailyTracker() to decide whether to trigger the celebratory message only when newStreak > previousStreak; ensure no celebratory message is shown when newStreak === previousStreak (already checked in today)."
        }
      ]
    }
  ]
}