{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add share option for daily affirmations",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a share button to the daily affirmations display that allows users to share the current day's affirmation message",
      "acceptanceCriteria": [
        "A share button is visible on the daily affirmation card",
        "Clicking the share button triggers a native share dialog (Web Share API) if available",
        "The shared content includes the full affirmation text",
        "If Web Share API is not available, provide a fallback to copy the affirmation to clipboard",
        "User receives visual feedback when sharing is successful or when text is copied"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useShareAffirmation.ts",
          "operation": "create",
          "description": "Create a custom hook that encapsulates share logic with Web Share API detection, fallback to clipboard copy, and user feedback through toast notifications. The hook accepts an affirmation message and attribution text, returns a share function and loading state, and handles browser compatibility gracefully."
        },
        {
          "path": "frontend/src/pages/MainPage.tsx",
          "operation": "modify",
          "description": "Add a share button to the daily message card section that invokes the useShareAffirmation hook with the current day's affirmation message. Position the button appropriately within the existing card layout, maintaining consistency with the card-based UI design. Include visual feedback for share success or clipboard copy events using existing toast patterns."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Format the shared affirmation message to include attribution indicating it came from the Daily Affirmations app",
      "acceptanceCriteria": [
        "Shared message includes the affirmation text followed by a subtle attribution line",
        "Attribution maintains a consistent format across all shares",
        "The format is user-friendly and appropriate for social media sharing"
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/formatShareMessage.ts",
          "operation": "create",
          "description": "Create a utility function that formats the affirmation message with attribution. The function accepts the raw affirmation text and returns a formatted string that includes the affirmation followed by a consistent attribution line such as '- Daily Affirmations'. The format should be social-media-friendly with appropriate line breaks."
        },
        {
          "path": "frontend/src/hooks/useShareAffirmation.ts",
          "operation": "modify",
          "description": "Import and use the formatShareMessage utility to format the affirmation message before sharing or copying to clipboard. Ensure the formatted message is used consistently in both the Web Share API call and the clipboard fallback."
        }
      ]
    }
  ]
}